FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/ui2c_reg.h
#define UI2C_PROTCTL_SCLOUTEN_Pos    ( 8 )                                                 /*!< UI2C_T::PROTCTL: SCLOUTEN Position     */
#define UI2C_PROTCTL_SCLOUTEN_Msk    ( 0x1ul << UI2C_PROTCTL_SCLOUTEN_Pos )                /*!< UI2C_T::PROTCTL: SCLOUTEN Mask         */

#define UI2C_PROTCTL_MONEN_Pos       ( 9 )                                                 /*!< UI2C_T::PROTCTL: MONEN Position        */
#define UI2C_PROTCTL_MONEN_Msk       ( 0x1ul << UI2C_PROTCTL_MONEN_Pos )                   /*!< UI2C_T::PROTCTL: MONEN Mask            */

#define UI2C_PROTCTL_TOCNT_Pos       ( 16 )                                                /*!< UI2C_T::PROTCTL: TOCNT Position        */
#define UI2C_PROTCTL_TOCNT_Msk       ( 0x3fful << UI2C_PROTCTL_TOCNT_Pos )                 /*!< UI2C_T::PROTCTL: TOCNT Mask            */

#define UI2C_PROTCTL_PROTEN_Pos      ( 31 )                                                /*!< UI2C_T::PROTCTL: PROTEN Position       */
#define UI2C_PROTCTL_PROTEN_Msk      ( 0x1ul << UI2C_PROTCTL_PROTEN_Pos )                  /*!< UI2C_T::PROTCTL: PROTEN Mask           */

#define UI2C_PROTIEN_TOIEN_Pos       ( 0 )                                                 /*!< UI2C_T::PROTIEN: TOIEN Position        */
#define UI2C_PROTIEN_TOIEN_Msk       ( 0x1ul << UI2C_PROTIEN_TOIEN_Pos )                   /*!< UI2C_T::PROTIEN: TOIEN Mask            */

#define UI2C_PROTIEN_STARIEN_Pos     ( 1 )                                                 /*!< UI2C_T::PROTIEN: STARIEN Position      */
#define UI2C_PROTIEN_STARIEN_Msk     ( 0x1ul << UI2C_PROTIEN_STARIEN_Pos )                 /*!< UI2C_T::PROTIEN: STARIEN Mask          */

#define UI2C_PROTIEN_STORIEN_Pos     ( 2 )                                                 /*!< UI2C_T::PROTIEN: STORIEN Position      */
#define UI2C_PROTIEN_STORIEN_Msk     ( 0x1ul << UI2C_PROTIEN_STORIEN_Pos )                 /*!< UI2C_T::PROTIEN: STORIEN Mask          */

#define UI2C_PROTIEN_NACKIEN_Pos     ( 3 )                                                 /*!< UI2C_T::PROTIEN: NACKIEN Position      */
#define UI2C_PROTIEN_NACKIEN_Msk     ( 0x1ul << UI2C_PROTIEN_NACKIEN_Pos )                 /*!< UI2C_T::PROTIEN: NACKIEN Mask          */

#define UI2C_PROTIEN_ARBLOIEN_Pos    ( 4 )                                                 /*!< UI2C_T::PROTIEN: ARBLOIEN Position     */
#define UI2C_PROTIEN_ARBLOIEN_Msk    ( 0x1ul << UI2C_PROTIEN_ARBLOIEN_Pos )                /*!< UI2C_T::PROTIEN: ARBLOIEN Mask         */

#define UI2C_PROTIEN_ERRIEN_Pos      ( 5 )                                                 /*!< UI2C_T::PROTIEN: ERRIEN Position       */
#define UI2C_PROTIEN_ERRIEN_Msk      ( 0x1ul << UI2C_PROTIEN_ERRIEN_Pos )                  /*!< UI2C_T::PROTIEN: ERRIEN Mask           */

#define UI2C_PROTIEN_ACKIEN_Pos      ( 6 )                                                 /*!< UI2C_T::PROTIEN: ACKIEN Position       */
#define UI2C_PROTIEN_ACKIEN_Msk      ( 0x1ul << UI2C_PROTIEN_ACKIEN_Pos )                  /*!< UI2C_T::PROTIEN: ACKIEN Mask           */

#define UI2C_PROTSTS_TOIF_Pos        ( 5 )                                                 /*!< UI2C_T::PROTSTS: TOIF Position         */
#define UI2C_PROTSTS_TOIF_Msk        ( 0x1ul << UI2C_PROTSTS_TOIF_Pos )                    /*!< UI2C_T::PROTSTS: TOIF Mask             */

#define UI2C_PROTSTS_ONBUSY_Pos      ( 6 )                                                 /*!< UI2C_T::PROTSTS: ONBUSY Position       */
#define UI2C_PROTSTS_ONBUSY_Msk      ( 0x1ul << UI2C_PROTSTS_ONBUSY_Pos )                  /*!< UI2C_T::PROTSTS: ONBUSY Mask           */

#define UI2C_PROTSTS_STARIF_Pos      ( 8 )                                                 /*!< UI2C_T::PROTSTS: STARIF Position       */
#define UI2C_PROTSTS_STARIF_Msk      ( 0x1ul << UI2C_PROTSTS_STARIF_Pos )                  /*!< UI2C_T::PROTSTS: STARIF Mask           */

#define UI2C_PROTSTS_STORIF_Pos      ( 9 )                                                 /*!< UI2C_T::PROTSTS: STORIF Position       */
#define UI2C_PROTSTS_STORIF_Msk      ( 0x1ul << UI2C_PROTSTS_STORIF_Pos )                  /*!< UI2C_T::PROTSTS: STORIF Mask           */

#define UI2C_PROTSTS_NACKIF_Pos      ( 10 )                                                /*!< UI2C_T::PROTSTS: NACKIF Position       */
#define UI2C_PROTSTS_NACKIF_Msk      ( 0x1ul << UI2C_PROTSTS_NACKIF_Pos )                  /*!< UI2C_T::PROTSTS: NACKIF Mask           */

#define UI2C_PROTSTS_ARBLOIF_Pos     ( 11 )                                                /*!< UI2C_T::PROTSTS: ARBLOIF Position      */
#define UI2C_PROTSTS_ARBLOIF_Msk     ( 0x1ul << UI2C_PROTSTS_ARBLOIF_Pos )                 /*!< UI2C_T::PROTSTS: ARBLOIF Mask          */

#define UI2C_PROTSTS_ERRIF_Pos       ( 12 )                                                /*!< UI2C_T::PROTSTS: ERRIF Position        */
#define UI2C_PROTSTS_ERRIF_Msk       ( 0x1ul << UI2C_PROTSTS_ERRIF_Pos )                   /*!< UI2C_T::PROTSTS: ERRIF Mask            */

#define UI2C_PROTSTS_ACKIF_Pos       ( 13 )                                                /*!< UI2C_T::PROTSTS: ACKIF Position        */
#define UI2C_PROTSTS_ACKIF_Msk       ( 0x1ul << UI2C_PROTSTS_ACKIF_Pos )                   /*!< UI2C_T::PROTSTS: ACKIF Mask            */

#define UI2C_PROTSTS_SLASEL_Pos      ( 14 )                                                /*!< UI2C_T::PROTSTS: SLASEL Position       */
#define UI2C_PROTSTS_SLASEL_Msk      ( 0x1ul << UI2C_PROTSTS_SLASEL_Pos )                  /*!< UI2C_T::PROTSTS: SLASEL Mask           */

#define UI2C_PROTSTS_SLAREAD_Pos     ( 15 )                                                /*!< UI2C_T::PROTSTS: SLAREAD Position      */
#define UI2C_PROTSTS_SLAREAD_Msk     ( 0x1ul << UI2C_PROTSTS_SLAREAD_Pos )                 /*!< UI2C_T::PROTSTS: SLAREAD Mask          */

#define UI2C_PROTSTS_WKAKDONE_Pos    ( 16 )                                                /*!< UI2C_T::PROTSTS: WKAKDONE Position     */
#define UI2C_PROTSTS_WKAKDONE_Msk    ( 0x1ul << UI2C_PROTSTS_WKAKDONE_Pos )                /*!< UI2C_T::PROTSTS: WKAKDONE Mask         */

#define UI2C_PROTSTS_WRSTSWK_Pos     ( 17 )                                                /*!< UI2C_T::PROTSTS: WRSTSWK Position      */
#define UI2C_PROTSTS_WRSTSWK_Msk     ( 0x1ul << UI2C_PROTSTS_WRSTSWK_Pos )                 /*!< UI2C_T::PROTSTS: WRSTSWK Mask          */

